import pandas as pd

data = pd.read_excel (r'chart.xlsx')
sex = pd.DataFrame(data,columns"u'1. เพศ',
       u'2. เกิดในช่วงใด', u'3. ระดับการศึกษา',
       u'4.  จำนวนพี่น้องร่วมบิดามารดา (คน)',
       u'5. ลำดับการเกิดเป็นบุตรคนที่......ของครอบครัว',
       u'6. ผู้ที่เลี้ยงดูในวัยเยาว์\t',
       u'1. วางกฎเกณฑ์ให้ลูกปฏิบัติอย่างเข้มงวด',
       u'2. ลงโทษลูกเมื่อไม่ทำตามความคาดหวัง',
       u'3.ยอมรับในคำพูดของพ่อแม่ว่าถูกต้องเสมอ',
       u'4.กำหนดให้ลูกปฏิบัติตามอย่างมีเหตุผล', u'5.ให้โอกาสลูกอธิบายเหตุผล',
       u'6.รับฟังเหตุผลของลูก', u'7.มีความใกล้ชิดสนิทสนม',
       u'8.คำนึงถึงความรู้สึกของลูก', u'9.เปิดโอกาสให้ลูกเป็นตัวของตัวเอง',
       u'10.สนับสนุนให้ลูกตัดสินใจเรื่องต่างๆ ของครอบครัว',
       u'11.พ่อแม่ให้คำปรึกษาโดยคอยโอนอ่อนผ่อนตามลูก',
       u'12.ดูแลเฉพาะเรื่องร่างกาย การกินอยู่และความต้องการพื้นฐาน',
       u'13.สนใจหรือตอบสนองความต้องการของลูก',
       u'14.พ่อแม่และฉันมักคุยกันเมื่อมีเวลาว่าง',
       u'15.เมื่อมีปัญหาหนักใจพ่อแม่มักช่วยคลี่คลายให้',
       u'16.ดูแลเอาใจใส่ใกล้ชิดเมื่อไม่สบาย',
       u'17.พ่อแม่มีเวลาพอที่จะให้ความเอาใจใส่ลูก',
       u'18.พ่อแม่แสดงให้เห็นว่ารักลูกทั้งคำพูดและการกระทำ',
       u'19.เมื่อมีปัญหามักปรึกษาพ่อแม่',
       u'ความคาดหวังของท่านที่มีต่อคุณพ่อคุณแม่ในขณะนั้น (ยกตัวอย่างเหตุการณ์ประกอบคำอธิบาย)'")     
print (sex)